import random

print("\t\t\tДобро пожаловать в игру 'Отгадай число'!")
print('\nЯ загадал натуральное число от 1 до 100.')
print('Постарайтесь отгадать его за минимальное число попыток.\n')

the_number = random.randint(1, 100) # случайное число от 1 до 100
guess = int(input("Ваше предположение: ")) # пользовательский ввод
tries = 1 # кол-во попыток
# цикл отгадывания
while guess != the_number: # исполнять код пока guess не равно the_number
    if guess > the_number: # если guess больше the_number
        print("Число меньше...")
    else: # в другом случае
        print("Число больше...")
    guess = int(input("Ваше предположение: ")) # Вновь запрашиваем число от пользователя
    tries += 1 # добавляем число поппыток оператором +=
print('-----------------------------------------------------')
print("Вам удалось отгадать число! Это число ", the_number)
print(f"Вы затратили {tries} попыток")
print('-----------------------------------------------------')
print('\t\t\t\tСПАСИБО ЗА ИГРУ!')